Revit 2027 API
Application.NewVertexIndexPair Method
Creates a new VertexIndexPair object.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public VertexIndexPair NewVertexIndexPair(
	int iTop,
	int iBottom
)
Public Function NewVertexIndexPair (
	iTop As Integer,
	iBottom As Integer
) As VertexIndexPair
public:
VertexIndexPair^ NewVertexIndexPair(
	int iTop,
	int iBottom
)
member NewVertexIndexPair :
        iTop : int *
        iBottom : int -> VertexIndexPair
Parameters
iTop Int32
The index of the vertex pair from the top profile of a blend.
iBottom Int32
The index of the vertex pair from the bottom profile of a blend.
Return Value
VertexIndexPair
The new VertexIndexPair object.
See Also
Reference
Application Class
Autodesk.Revit.Creation Namespace